Revit 2026 API

# ElectricalSystemApparentCurrentPhaseB Property

---

The ApparentCurrentPhaseB value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ApparentCurrentPhaseB { get; }
```
```vb
Public ReadOnly Property ApparentCurrentPhaseB As Double
	Get
```
```cpp
public:
property double ApparentCurrentPhaseB {
	double get ();
}
```
```fsharp
member ApparentCurrentPhaseB : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the ApparentCurrentPhaseB value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace